In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(1, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'AR5KOSW1187FB35FF4', 'SOZCTXZ12AB0182364', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(51, 'Maia', 'Burke', 'F', 'free'),
 (94, 'Noah', 'Chavez', 'M', 'free'),
 (61, 'Samuel', 'Gonzalez', 'M', 'free'),
 (13, 'Ava', 'Robinson', 'F', 'free'),
 (100, 'Adler', 'Barrera', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs where title='Mercy:The Laundromat'

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARMAC4T1187FB3FA4C', 'The Dillinger Escape Plan', 'Morris Plains, NJ', Decimal('40.82624'), Decimal('-74.47995')),
 ('ARB29H41187B98F0EF', 'Terry Callier', 'Chicago', Decimal('41.88415'), Decimal('-87.63241')),
 ('ARGIWFO1187B9B55B7', 'Five Bolt Main', '', Decimal('NaN'), Decimal('NaN')),
 ('ARH4Z031187B9A71F2', 'Faye Adams', 'Newark, NJ', Decimal('40.73197'), Decimal('-74.17418')),
 ('AR5KOSW1187FB35FF4', 'Elena', 'Dubai UAE', Decimal('49.80388'), Decimal('15.47491'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 12, 2, 37, 38, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 37, 44, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 42, 21, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 45, 52, 796000), 2, 12, 46, 11, 2018, 0),
 (datetime.datetime(2018, 11, 12, 2, 47, 22, 796000), 2, 12, 46, 11, 2018, 0)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
%sql SELECT a.artist_id, s.song_id FROM songs s INNER JOIN artists a ON s.artist_id = a.artist_id     WHERE s.title='Mercy:The Laundromat'

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [9]:
Mercy:The Laundromat Pavement

SyntaxError: invalid syntax (<ipython-input-9-1a452065e042>, line 1)

In [10]:
%sql SELECT a.artist_id, s.song_id FROM songs s INNER JOIN artists a ON s.artist_id = a.artist_id     WHERE s.title='Do You Finally Need A Friend'

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARB29H41187B98F0EF', 'SOGNCJP12A58A80271')]